Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.step_functions_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "step_functions_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "StepFunctionsDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_event_target.state_machine_target will be created
+ resource "aws_cloudwatch_event_target" "state_machine_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::481665084477:role/animeutopia_eventbridge_step_functions_role"
      + rule           = "animeutopia_workflow_schedule"
      + target_id      = "animeutopia_StepFunctionStateMachine"
    }

  # aws_cloudwatch_log_group.notify_post_log_group will be created
+ resource "aws_cloudwatch_log_group" "notify_post_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/notify_post"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_aborts will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_aborts" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:481665084477:animeutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if the automated Step Function is aborted within a 5-minute window."
      + alarm_name                            = "animeutopia-automated-workflow-aborts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsAborted"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_failures will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_failures" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:481665084477:animeutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if the automated Step Function fails within a 5-minute window."
      + alarm_name                            = "animeutopia-automated-workflow-failures"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsFailed"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_timeouts will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_timeouts" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:481665084477:animeutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if the automated Step Function times out within a 5-minute window."
      + alarm_name                            = "animeutopia-automated-workflow-timeouts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsTimedOut"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_iam_policy.eventbridge_policy will be created
+ resource "aws_iam_policy" "eventbridge_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CloudWatch Event to start Step Functions executions"
      + id               = (known after apply)
      + name             = "animeutopia_eventbridge_step_functions_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
    }

  # aws_iam_role_policy_attachment.attach_eventbridge_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_eventbridge_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "animeutopia_eventbridge_step_functions_role"
    }

  # aws_sfn_state_machine.automated_workflow will be created
+ resource "aws_sfn_state_machine" "automated_workflow" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "State machine for automating post workflow"
              + StartAt = "FetchData"
              + States  = {
                  + CheckDuplicate = {
                      + InputPath  = "$.fetched"
                      + Next       = "CheckPost"
                      + Resource   = "arn:aws:lambda:us-east-2:481665084477:function:check_duplicate"
                      + ResultPath = "$.dupCheck"
                      + Type       = "Task"
                    }
                  + CheckPost      = {
                      + Choices = [
                          + {
                              + Next         = "EndWorkflow"
                              + StringEquals = "duplicate"
                              + Variable     = "$.dupCheck.status"
                            },
                          + {
                              + Next         = "NotifyUser"
                              + StringEquals = "post_found"
                              + Variable     = "$.dupCheck.status"
                            },
                        ]
                      + Default = "EndWorkflow"
                      + Type    = "Choice"
                    }
                  + EndWorkflow    = {
                      + Type = "Succeed"
                    }
                  + FetchData      = {
                      + Next       = "CheckDuplicate"
                      + Resource   = "arn:aws:lambda:us-east-2:481665084477:function:fetch_data"
                      + ResultPath = "$.fetched"
                      + Type       = "Task"
                    }
                  + NotifyUser     = {
                      + End        = true
                      + InputPath  = "$.fetched"
                      + Resource   = "arn:aws:lambda:us-east-2:481665084477:function:notify_post"
                      + ResultPath = "$.notificationResult"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "automated_animeutopia_workflow"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::481665084477:role/animeutopia_step_functions_role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + type                      = "EXPRESS"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = "arn:aws:logs:us-east-2:481665084477:log-group:/aws/vendedlogs/states/automated_workfloww:*"
        }

      + tracing_configuration {
          + enabled = true
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```